#include<stdio.h>
int main()
{
    double a,b;
    int c;
    printf("请输入利润：");
    scanf("%lf",&a);
    c = a/100000;
    switch (c)
    {
        case 0:b = a*0.1;break;
        case 1:b = (100000*0.1)+(a-100000)*0.075;break;
        case 2:
        case 3:b = (100000*0.1)+(100000*0.075)+(a-200000)*0.05;break;
        case 4:
        case 5:b = (100000*0.1)+(100000*0.075)+(200000*0.05)+(a-400000)*0.03;break;
        case 6:
        case 7:
        case 8:
        case 9:b = (100000*0.1)+(100000*0.075)+(200000*0.05)+(200000*0.03)+(a-600000)*0.015;break;
        default:b = (100000*0.1)+(100000*0.075)+(200000*0.05)+(200000*0.03)+(400000*0.015)+(a-1000000)*0.01;
    }
    printf("应发奖金为%0.2f\n",b);
    return 0;
}
